artillery.yml
config:
  target: https://myservices.intcomex.com
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Ramp up"
    - duration: 60
      arrivalRate: 20
      name: "Full load"
  engines:
    playwright:
      headless: true
      maxContexts: 30
  processor: "./artillery-flow.js"

scenarios:
  - name: "Store y categoría"
    engine: playwright
    flowFunction: "storeFlow"